let Article = Object.create(null);
Article = [
  {
    time: "2018-12-10",
    title: "哲学的故事 novel",
    category: "novel",
    p: [
      "《哲学的故事》是2013年5月新星出版社出版图书，作者是（美）威尔·杜兰特。本书着重描述了人类史上数十位著名哲学家的境遇、情感与生平，因之，它并不该被看做是一部哲学史，而是一部关于哲学家的故事。",
      "这些故事本身奇巧而有趣，加上作者娓娓动听的叙述，使它变成了一部极富魅力的人文经典。该书自问世以来，一直畅销不衰，给热爱哲学但又心存敬畏的读者们敞开了一扇亲切的大门。",
      "苏格拉底服毒、柏拉图逃亡、亚里士多德被流放，为了真理师徒三人前仆后继；培根立遗嘱托付“把灵魂送给上帝，把躯体留给泥土，把名字留给后世”； 伏尔泰和卢梭两人合伙“击垮了法国”。",
      "威尔·杜兰特以苏格拉底的谦逊、伏尔泰的洞察力和恒心、罗素的冷静，用生动幽默的文笔，将哲学思想融合于血肉之躯，记述了从苏格拉底到约翰·杜威等有史以来的主要哲学家，让读者在最短的时间内、用最有趣的方法读懂漫长的哲学发展和艰深的哲学精髓。"
    ],
    img: "http://img4.imgtn.bdimg.com/it/u=2045718633,1222283989&fm=26&gp=0.jpg"
  },
  {
    time: "2018-12-11",
    title: "测试标题 -movie",
    category: "movie",
    p: ["1", "2", "3", "4"],
    img: ""
  },
  {
    time: "2018-12-12 02:44:27",
    title: "普京“神秘女儿”首上电视 外媒：她或继承俄总统大位 -novel",
    category: "novel",
    p: [
      "原标题：普京“神秘女儿”首次上电视外媒：她或继承俄总统大位",
      "海外网12月11日电 俄罗斯总统普京向来会自己的私生活三缄其口。然而近日有外媒曝出，一位疑似普京小女儿的科学家，日前在俄国一电视节目中公开露面。但克里姆林宫方面则拒绝对此作出回应。",
      "据《纽约时报》8日报道，当地时间7日，俄罗斯科研机构副所长提洪诺娃（Katerina Tkhonova）接受电视访问，介绍她的团队正在研发一种能阅读脑波的设备。虽然普京从未公开承认自己的小女儿（Yekaterina Vladimirovna Putina）与这位科学家的关系，但他曾说过“我的女儿正致力于科学领域发展”，而这两人的名字中刚好也都有卡捷琳娜（Katerina）。加之提洪诺娃的外表也与普京极像，因此不少俄罗斯和西方媒体都认为提洪诺娃就是普京的小女儿。",
      "然而克里姆林宫方面，则拒绝对提洪诺娃的真实身份做出回应。"
    ],
    img:
      "http://p0.ifengimg.com/2018_50/0B132B9B045B25CDE7A81164EBDFBE2DCD88BD50_w634_h423.jpg"
  },
  {
    time: "2018-12-13",
    title: "测试标题3-movie",
    category: "movie",
    p: ["123", "123", "123", "123"],
    img: ""
  }
];
