const str = '12 fff 87 er334 233 -=-=fa80';
console.log('str.match(/d+/g): ', str.match(/\d+/g));
// str.match(/d+/g):  [ '12', '87', '334', '233', '80' ]
/*
Array-like objects
https://2ality.com/2013/05/quirk-array-like-objects.html
JavaScript quirks
Array-like objects
has: indexed access to elements and the property length that tells us how many elements the object has.
does not have: array methods such as push, forEach and indexOf.
Two examples of array - like objects is
document.getElementsByClassName()
special variable arguments
*/
/*
https://xw.qq.com/cmsid/20180504A1EL9W00
http://www.qdaily.com/articles/19604.html

有数据显示现代人90%患有松鼠病。松鼠病已和焦虑症、懒癌一起被列为本世纪人类三大绝症。
松鼠病:强迫性囤积症

电子资源松鼠

知乎网友@智步是典型的“电子资源松鼠”，他这样描述自己的松鼠行为：

“每每得到一个关键词或者对一个资源感兴趣就会全神灌注地把能找到的周边全部下载下来，经常几个G几十个G的从网上拖东西。

我保存了几百部经典好莱坞剧本，硬盘里有几年前热播的美剧，微博、微信的收藏夹里存满了“有用”的转发。

每次按下“收藏”键的时候，我都想：这是一个非常好的资源，我一定能抽出时间从中学到点什么，有些可能会在危难中拯救我的性命。”

然而最后这些资源很大程度上只是静静的躺在那里，从没点开过。智步相信：总有一天会看的，虽然不知道那一天什么时候到来。




对信息有着强烈掌控欲的还有“知识松鼠”。

想学理财知识，收藏了很多书单、公众文章，却从来没看过；

想学英语，下载了一大堆学习资料，却从来没跟着学过；

想健身，购买了许许多多付费课程，却从来没上完一节课。

对于他们来说，不能错过任何有用的信息，却在分辨它们有用与否中耗费了大量的精力



按理说，对比二三十年前，现在的物质精神生活都丰富很多，几乎是动动手指，要什么有什么，可为什么还是有那么多人控制不住自己？

人都有囤积的本能。

比如囤积邮票、旧钱币等有升值前景的东西；比如囤积有纪念意义或十分珍贵的东西，我们称之为“收藏”。

而“松鼠病”这种盲目囤积不是收藏，它不会带给你成就感，它顶多只是在提供安全感和满足感。

我们一边不理性地获取，一边难以理性地舍弃。日复一日，我们逐渐被各种“宝贝”所吞没。

美国著名心理学博士罗宾·扎修曾说过：

世上没有免费的午餐。免费的东西很少真的是免费的，在杂乱、无组织甚至金钱上都会让你付出很大代价。

-------2--------


松鼠症患者最熟悉的动作是 mark 一下，然后永远不会看。本所的另一项调查“先 mark 一下而永远不会看的东西”显示，最多被 mark 而又无情遗忘的东西包括：书单（27%），APP 榜单（25%），健身教程（12%），Excel 实用技巧大全这一类的工作指导类文章（10%），公开课（7%），XX 事件分析文（6%）。

书单就别提了，从看到书单到加到购物车到收货到翻开才完成了“买书如山倒读书如抽丝”的第一步；而 APP 榜单如果没有一键下载也让人根本没有耐心去找；健身教程和公开课的话，转发或者点击收藏会让人有一种似乎真的会积极健康生活的错觉；Excel 技巧则属于“总有一天会用到的管他是什么时候但我现在真的不想看”这一类；而长文章……如果不是八卦类好像也根本看不完呢。

这些东西收藏的时候看起来也是像松鼠过冬的必需品一样，然而你知道收藏书单你永远不会看，对吧。





*/
