/* 

# 中台

[编译速度提升 700%，字节跳动中台技术揭秘-InfoQ](https://www.infoq.cn/article/0d1PN9*VNAdKzyY22NFC)

从 BAT 到美团、京东、华为都在调整组织架构，建立自己的中台部门，一时间”中台战略“仿佛成了那把角逐互联网下半场的取胜之匙。
聊了这么多，到底什么是”中台“呢？
这里引用网络上的一段解释：在一部分人眼里：中台就是技术平台，像微服务开发框架、DevOps 平台、PaaS 平台，容器云之类的，人们都叫它“技术中台”；
在一部份人眼里：中台就是微服务业务平台，像最常见的什么用户中心、订单中心，各种微服务集散地，人们都叫它“业务中台”；
在一些人眼里：中台应该是组织的事情，在释放潜能：平台型组织的进化路线图 (豆瓣) 中就提出了平台型组织和组织中台的概念，

这类组织中台在企业中主要起到投资评估与投后管理的作用，类

<!-- @import "[TOC]" {cmd="toc" depthFrom=1 depthTo=6 orderedList=false} -->

似于企业内部资源调度中心和内部创新孵化组织，人们叫它“组织中台”。
上面这段解释其实基本是符合业界对于”中台“在企业中的定位的，阿里玄难之前说过：
中台是一个基础的理念和架构，我们要把所有的基础服务用中台的思路建设，进行联通，共同支持端上的业务。

说到中台，大家可能首先会想到阿里的”大中台、小前台“战略，这的确是阿里人不懈努力的技术结晶。
华为也早在几年前就提出了”大平台炮火支撑精兵作战“的战略，其实跟阿里的方式有异曲同工之妙。
但这里不得不提一个公司，字节跳动。嘉御基金创始合伙人、前阿里巴巴 B2B 总裁卫哲在混沌大学讲课时曾经说过，今日头条的崛起很大程度在于今日头条是大互联网公司中第一个率先实现强中台的公司。有了强大的技术中台支持，字节跳动在前台放四五个员工，就能做出抖音这样的产品来，快速试错，不断迭代，大大提高了效率

*/
